#ifndef _WWDisplayP_h_INCLUDED_
#define _WWDisplayP_h_INCLUDED_

/*****************************************************************************/
/* ここから                                                                  */
/*****************************************************************************/

#include "WWDisplay.h"

/*****************************************************************************/
/* クラスの定義                                                              */
/*****************************************************************************/

typedef struct _WWDisplay {

  WWColorMap color_map;
  WWPalette palette[16];
  WWCharacter character[512];
  WWSprite sprite[128];
  WWScreen screen[2];
  WWLCDPanel lcd_panel;

  /* ディスプレイの属性情報 */
  int screen_enable[2]; /* スクリーン表示イネーブルフラグ */
  int sprite_enable;  /* スプライト表示イネーブルフラグ */
  int sprite_window_enable;  /* スプライトウインドウ機能イネーブルフラグ */

  /* スクリーン２ウインドウモード */
  /* 0,1... 無効 2...ウインドウの内側を表示 3...ウインドウの外側を表示 */
  int screen2_window_mode;

  int border; /* ボーダーカラー．0〜7のカラーマップ番号 */

  int foreground_color; /* モノクロフォント展開時の色 */
  int background_color; /* モノクロフォント展開時の色 */

  int sprite_start; /* スプライトの描画の指定 */
  int sprite_count; /* スプライトの描画の指定 */

} _WWDisplay;

/*****************************************************************************/
/* ここまで                                                                  */
/*****************************************************************************/

#endif

/*****************************************************************************/
/* End of File.                                                              */
/*****************************************************************************/
