#ifndef _WWInterruptP_h_INCLUDED_
#define _WWInterruptP_h_INCLUDED_

/*****************************************************************************/
/* ここから                                                                  */
/*****************************************************************************/

#include "WWInterrupt.h"

/*****************************************************************************/
/* クラスの定義                                                              */
/*****************************************************************************/

typedef struct _WWInterruptVector {
  int number;
  WWInterruptCallback callback;
  int cs;
  int ds;
} _WWInterruptVector;

typedef struct _WWInterruptVector * WWInterruptVector;

typedef struct _WWInterrupt {
  WWInterruptVector vector[8]; /* 割り込みは全部で８種類 */
} _WWInterrupt;

/*****************************************************************************/
/* ここまで                                                                  */
/*****************************************************************************/

#endif

/*****************************************************************************/
/* End of File.                                                              */
/*****************************************************************************/
