#ifndef _WWLCDPanelP_h_INCLUDED_
#define _WWLCDPanelP_h_INCLUDED_

/*****************************************************************************/
/* ここから                                                                  */
/*****************************************************************************/

#include "WWLCDPanel.h"

/*****************************************************************************/
/* クラスの定義                                                              */
/*****************************************************************************/

typedef struct _WWLCDPanel {
  int width;
  int height;

  /* Xサーバの負荷を減らすため，ビットマップを２枚持ち， */
  /* 前回と同じ部分は書き換えないようにする．            */
  /* pixel[current] が現在描画中のビットマップになる．   */
  /* pixel[1 - current] が前回のビットマップになる．     */
  int current;

  /* all_draw == 1 のときは，前回分が無いので，          */
  /* 全部描画することを示す．                            */
  int all_draw;

  /* 16色のカラー情報．１バイトで１ピクセル分の情報を持つ */
  unsigned char * pixel[2];
} _WWLCDPanel;

/*****************************************************************************/
/* ここまで                                                                  */
/*****************************************************************************/

#endif

/*****************************************************************************/
/* End of File.                                                              */
/*****************************************************************************/
