#ifndef _WWPaletteP_h_INCLUDED_
#define _WWPaletteP_h_INCLUDED_

/*****************************************************************************/
/* ここから                                                                  */
/*****************************************************************************/

#include "WWPalette.h"

/*****************************************************************************/
/* クラスの定義                                                              */
/*****************************************************************************/

typedef struct _WWPalette {

  int number;

  /*
   * WonX-2.0 以降から，透明色の判定は WWDisplay で行うように変更したので，
   * WWPalette で透明色を管理する必要は無くなった．一応コードを残しておく．
   */
#if 0
  int transparent; /* 0 は透明色になるかどうかのフラグ */
#endif

  /* 白黒モードの場合には，カラーマップの8色中から4色を選択 */
  int mapped_color[4]; /* 白黒モードでは，カラーマップの番号(0〜7)を持つ */

  /*
   * 4色カラー，16色カラーモードの場合には，rgb の色を使用する．
   * 4色カラーモードの場合には，0〜3までを使用する．
   * 16色カラーモードの場合には，0〜15までを全部使用する．
   */
  int red[16];
  int green[16];
  int blue[16];

} _WWPalette;

/*****************************************************************************/
/* ここまで                                                                  */
/*****************************************************************************/

#endif

/*****************************************************************************/
/* End of File.                                                              */
/*****************************************************************************/
