#ifndef _WWScreenP_h_INCLUDED_
#define _WWScreenP_h_INCLUDED_

/*****************************************************************************/
/* ここから                                                                  */
/*****************************************************************************/

#include "WWScreen.h"

/*****************************************************************************/
/* クラスの定義                                                              */
/*****************************************************************************/

/* スクリーンのマス目ごとに決まる，表示情報 */
typedef struct _WWScreenCharacter {
  int horizontal; /* 横方向反転フラグ */
  int vertical; /* 縦方向反転フラグ */
  WWPalette palette; /* パレット番号．0〜15 のパレット番号 */
  WWCharacter character; /* 表示キャラクタ */
} _WWScreenCharacter;

typedef struct _WWScreenCharacter * WWScreenCharacter;

typedef struct _WWScreen {
  int number;
  int width;
  int height;
  int roll_x;
  int roll_y;
  WWScreenCharacter * screen_characters;
} _WWScreen;

/*****************************************************************************/
/* ここまで                                                                  */
/*****************************************************************************/

#endif

/*****************************************************************************/
/* End of File.                                                              */
/*****************************************************************************/
